{
  "about_Me": "เกี่ยวกับฉัน",
  "graduate": "สวัสดีค่ะ ดิฉันชื่อ นางสาวสทุัตตา ลาจำนงค์ เป็นนักศึกษาจบใหม่จากมหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน คณะวิศวกรรมศาสตร์ สาขาวิศวกรรมคอมพิวเตอร์ ดิฉันมีความสนใจในการพัฒนาเว็บไซต์และแอปพลิเคชัน โดยเฉพาะในด้าน Front-end Development และ UX/UI Design ดิฉันมีประสบการณ์ฝึกงาน 4 เดือนในตำแหน่ง Front-end Developer ซึ่งได้พัฒนาแอปพลิเคชันมือถือด้วย Flutter และในโปรเจ็คจบของดิฉัน ได้พัฒนาระบบการลางานออนไลน์ภายในองค์กร โดยรับผิดชอบในการออกแบบและพัฒนา Front-end เพื่อให้ผู้ใช้สามารถใช้งานได้อย่างสะดวกและราบรื่น",
  "Junior": "สวัสดีค่ะ ฉันเป็นนักศึกษาจบใหม่จากสาขาวิศวกรรมคอมพิวเตอร์ และกำลังพัฒนาทักษะในสายงาน Front-end Development และ UX/UI ",
      "experiences": "และเชื่อว่าประสบการณ์ผู้ใช้ที่ดีเริ่มต้นจากการเข้าใจความต้องการของผู้ใช้จริง ฉันพร้อมเรียนรู้ เติบโต และร่วมมือกับทีมเพื่อสร้างงานที่ทั้งดูดีและใช้งานได้อย่างมีประสิทธิภาพ",
"Contact": "ติดต่อ",
"reserved": "2025 My Portfolio. All rights reserved.",
"Portfolio": "พอร์ตโฟลิโอ",
    "About": "เกี่ยวกับ",
    "Home": "หน้าหลัก",
    "Skills": "ทักษะ",
    "Projects": "โปรเจกต์",
    "Resume": "เรซูเม่",
    "Languages": "ภาษา",
    "Frameworks": "เฟรมเวิร์ก",
    "Tools": "เครื่องมือ",
    "Final_Project": "โปรเจกต์จบ",
    "Internship_Project": "โปรเจกต์ฝึกงาน",
    "leave": "ระบบขอลางานออนไลน์สำหรับพนักงานในองค์กร",
    "Flutter": "การพัฒนาแอปพลิเคชัน (ด้วย Flutter)",
    "jecti": "รับผิดชอบการพัฒนา Frontend และออกแบบ UX/UI สำหรับระบบบริหารจัดการการลาของบุคลากร โดยใช้ HTML, CSS และ JavaScript (Vanilla JS) ออกแบบ Wireframe และ User Flow ให้สอดคล้องกับบทบาทผู้ใช้ที่หลากหลาย เช่น พนักงาน หัวหน้าแผนก และผู้บริหาร โดยกำหนดสิทธิ์ตามหลัก Role-based Access Controlระบบมีฟีเจอร์หลัก เช่น การเข้าสู่ระบบ ยื่นคำขอลา อนุมัติ ตรวจสอบวันลา วันหยุด และสถิติการใช้งาน โดยมุ่งเน้นให้ใช้งานง่าย และรองรับการทำงานในระดับองค์กรอย่างเป็นระบบ",
    "jectii":"ระหว่างการฝึกงานในตำแหน่ง Frontend Developer รับผิดชอบในการพัฒนาแอปพลิเคชันบนอุปกรณ์พกพาโดยใช้ Flutter และภาษา Dart โดยมีหน้าที่ในการออกแบบและพัฒนา UI, เขียน Data Model, เรียกใช้งาน RESTful API ด้วย Postman และ Swagger รวมถึงการทำ Data Mapping เพื่อนำมาแสดงผลในหน้าต่างๆ ของแอปตาม Requirement ที่ได้รับมอบหมาย มีส่วนร่วมในการออกแบบ Mockup และเรียนรู้เทคนิคต่างๆเช่น Skeleton Loader แทนการใช้ตัวโหลดแบบดั้งเดิม เพื่อยกระดับประสบการณ์ผู้ใช้งานให้ดูราบรื่นและเป็นธรรมชาติ อีกทั้งยังประสานงานกับทีม Backend เพื่อให้การเชื่อมต่อข้อมูลเป็นไปอย่างถูกต้องและสอดคล้องกับระบบ"
  }
  